//6. Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.

public class Cycle_Task6_SquaresOfNumbers {
    public static void main(String[] args) {
        for (int i = 10; i <= 20; i++) {
            int square = i * i;
            System.out.println(square);
        }
    }
}

